In [0]:
import pandas as pd
import numpy as np

In [0]:
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

In [8]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

**loc** is label-based, which means that we have to specify the name of the rows and columns that we need to filter out.

**iloc** On the other hand, iloc is integer index-based. So here, we have to specify rows and columns by their integer index.

In [0]:
data.loc[data.age>=15]

In [9]:
data.loc[(data.age>=15 )& (data.gender=='M')]

   age section   city gender favourite_color
3   21       B  Delhi      M             NaN

In [10]:
data.loc[1:3]

   age section    city gender favourite_color
1   22       B   Delhi      F             NaN
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN

In [11]:
data.loc[(data.age>=12),['gender','city']]

  gender    city
1      F   Delhi
2      F  Mumbai
3      M   Delhi
4      M  Mumbai
6      F  Mumbai

In [0]:
data.loc[(data.age>=12),['section']]='M'

In [13]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F             NaN
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [0]:
data.loc[(data.age>=20),['section','city']]=['S','Pune']

In [15]:
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [16]:
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow

In [17]:
data.iloc[[0,2],[1,3]]

  section gender
0       A      M
2       M      F

In [18]:
data.iloc[1:3]

   age section    city gender favourite_color
1   22       S    Pune      F             NaN
2   13       M  Mumbai      F          yellow

In [19]:
data.iloc[1:3,2:4]

     city gender
1    Pune      F
2  Mumbai      F